import React from "react";
import styles from "./Contract.module.scss";
const Contract: React.FC = () => {
  return (
    <article className={styles.contract}>
      <p>
        Интернет-магазин flowers-ukraine.com (далее ПРОДАВЕЦ), публикует
        настоящий договор, являющийся публичным договором-офертой в&nbsp;адрес
        как физических, так и&nbsp;юридических лиц (далее ПОКУПАТЕЛЬ)
        о&nbsp;нижеследующем:
      </p>
      <p>Статья&nbsp;1. Предмет договора-оферты.</p>
      <p>
        1.1. ПРОДАВЕЦ обязуется произвести пополнение виртуального счета
        на&nbsp;сайте flowers-ukraine.com ПОКУПАТЕЛЮ, а&nbsp;ПОКУПАТЕЛЬ
        обязуется оплатить услугу любым удобным способом на&nbsp;сайте
        платежного шлюза WWW.INTERKASSA.COM.
      </p>
      <p>Статья&nbsp;2. Момент заключения договора.</p>
      <p>2.1. Текст данного Договора является публичной офертой</p>
      <p>
        2.2. Факт оформления ЗАКАЗА УСЛУГИ у&nbsp;ПРОДАВЦА как самостоятельно,
        так и&nbsp;через оператора, является безоговорочным принятием данного
        Договора, и&nbsp;ПОКУПАТЕЛЬ рассматривается как лицо, вступившее
        с&nbsp;ПРОДАВЦОМ в&nbsp;договорные отношения.
      </p>
      <p>
        2.3. Оформление ЗАКАЗА УСЛУГИ и&nbsp;расчета осуществляется путем заказа
        ПОКУПАТЕЛЕМ в&nbsp;интернет-магазине flowers-ukraine.com.
      </p>
      <p>Статья&nbsp;3. Стоимость УСЛУГИ.</p>
      <p>
        3.1. Цены в&nbsp;интернет-магазине указаны в&nbsp;валюте страны
        покупателя.
      </p>
      <p>
        3.2. Стоимость УСЛУГИ выбирается ПОКУПАТЕЛЕМ, от&nbsp;нее зависит сумма,
        которая будет зачислена ПОКУПАТЕЛЮ на&nbsp;виртуальный счет сайта
        flowers-ukraine.com.
      </p>
      <p>
        3.3. Один ПОКУПАТЕЛЬ имеет право заказывать УСЛУГУ неограниченное
        количество раз.
      </p>
      <p>Статья&nbsp;4. Оплата УСЛУГИ.</p>
      <p>
        4.1. Оплата услуги осуществляется ПОКУПАТЕЛЕМ одним из&nbsp;множества
        доступных способов, на&nbsp;сайте платежного шлюза WWW.INTERKASSA.COM
      </p>
      <p>
        4.2. В&nbsp;большинстве случаев, комиссия с&nbsp;ПОКУПАТЕЛЯ
        не&nbsp;взимается, однако платежный шлюз WWW.INTERKASSA.COM,
        а&nbsp;так&nbsp;же платежная система имеют право взимать
      </p>
      <p>Статья&nbsp;5. Оказание УСЛУГИ.</p>

      <p>
        5.1. В&nbsp;большинстве случаев оказание УСЛУГИ ПОКУПАТЕЛЮ
        осуществляется автоматической системой после проведения платежа
        в&nbsp;срок не&nbsp;более одного часа.
      </p>
      <p>
        5.2. В&nbsp;случае, если в&nbsp;течение одного часа УСЛУГА ПОКУПАТЕЛЮ
        не&nbsp;оказана, он&nbsp;обязан сообщить о&nbsp;возникновении проблемы
        консультанту по&nbsp;телефону и&nbsp;указать необходимые для проверки
        платежа сведения, в&nbsp;этом случае УСЛУГА будет оказана в&nbsp;ручном
        режиме в&nbsp;течение 48&nbsp;часов с&nbsp;момента обращения.
      </p>
      <p>Статья&nbsp;6. Права и&nbsp;обязанности сторон.</p>
      <p>6.1. ПРОДАВЕЦ обязуется:</p>
      <p>
        6.1.1. Не&nbsp;разглашать любую частную информацию ПОКУПАТЕЛЯ
        и&nbsp;не&nbsp;предоставлять доступ к&nbsp;этой информации третьим
        лицам, за&nbsp;исключением случаев, предусмотренных законодательством.
      </p>
      <p>
        6.1.2. Предоставить ПОКУПАТЕЛЮ возможность получения бесплатных
        консультаций по&nbsp;контактным данным, указанным на&nbsp;сайте магазина
        (flowers-ukraine.com). Объем консультаций ограничивается конкретными
        вопросами, связанными с&nbsp;выполнениями ЗАКАЗА.
      </p>
      <p>
        6.1.3. Оказать ПОКУПАТЕЛЮ УСЛУГУ пополнения счета на&nbsp;сайте
        flowers-ukraine.com автоматической системой в&nbsp;течение часа после
        оплаты услуги, либо в&nbsp;ручном режиме в&nbsp;течение 48&nbsp;часов
        после обращение ПОКУПАТЕЛЯ в&nbsp;консультанту (см.&nbsp;п.5.2).
      </p>
      <p>
        6.1.4. ПРОДАВЕЦ оставляет за&nbsp;собой право изменять настоящий ДОГОВОР
        в&nbsp;одностороннем порядке до&nbsp;момента его заключения.
      </p>
      <p>6.2. ПОКУПАТЕЛЬ обязуется:</p>
      <p>
        6.2.1. До&nbsp;момента заключения ДОГОВОРА ознакомиться
        с&nbsp;содержанием договора-оферты, условиями оплаты и&nbsp;доставки
        на&nbsp;сайте магазина (flowers-ukraine.com).
      </p>
      <p>
        6.2.2. Предоставлять достоверную информацию о&nbsp;себе (контактные
        телефоны, адрес электронной почты) и&nbsp;реквизиты для доставки
        уведомления об&nbsp;успешном платеже.
      </p>
      <p>Статья&nbsp;7. Ответственность сторон и&nbsp;разрешение споров.</p>
      <p>
        7.1. Стороны несут ответственность за&nbsp;неисполнение или ненадлежащее
        исполнение настоящего ДОГОВОРА в&nbsp;порядке, предусмотренном настоящим
        ДОГОВОРОМ и&nbsp;действующим законодательством.
      </p>
      <p>
        7.3. ПРОДАВЕЦ не&nbsp;несет ответственности, если различные ожидания
        ПОКУПАТЕЛЯ об&nbsp;оказанной услуге оказались не&nbsp;оправданны.
      </p>
      <p>
        7.4. ПРОДАВЕЦ не&nbsp;несет ответственности за&nbsp;частичное или полное
        неисполнение обязательств по&nbsp;оказанию УСЛУГИ, если они являются
        следствием форс-мажорных обстоятельств.
      </p>
      <p>
        7.5. ПОКУПАТЕЛЬ, оформляя ЗАКАЗ, несет ответственность
        за&nbsp;достоверность предоставляемой информации о&nbsp;себе,
        а&nbsp;так&nbsp;же подтверждает, что с&nbsp;условиями настоящего
        ДОГОВОРА ознакомлен и&nbsp;согласен.
      </p>
      <p>
        7.6. Все споры и&nbsp;разногласия, возникающие при исполнении СТОРОНАМИ
        обязательств по&nbsp;настоящему Договору, решаются путем переговоров.
        В&nbsp;случае невозможности их&nbsp;устранения, СТОРОНЫ имеют право
        обратиться за&nbsp;судебной защитой своих интересов.
      </p>
      <p>Статья&nbsp;8. Возврат средств.</p>
      <p>
        8.1. Все платежи на&nbsp;сайте flowers-ukraine.com конечны
        и&nbsp;не&nbsp;могут быть возвращены полностью или частично на&nbsp;счет
        ПОКУПАТЕЛЯ.
      </p>
      <p>Статья&nbsp;9. Форс-мажорные обстоятельства.</p>
      <p>
        9.1. Стороны освобождаются от&nbsp;ответственности за&nbsp;неисполнение
        или ненадлежащее исполнение обязательств по&nbsp;Договору на&nbsp;время
        действия непреодолимой силы. Под непреодолимой силой понимаются
        чрезвычайные и&nbsp;непреодолимые при данных условиях обстоятельства,
        препятствующие исполнению своих обязательств СТОРОНАМИ
        по&nbsp;настоящему Договору. К&nbsp;ним относятся стихийные явления
        (землетрясения, наводнения и&nbsp;т.&nbsp;п.), обстоятельства
        общественной жизни (военные действия, чрезвычайные положения, крупнейшие
        забастовки, эпидемии и&nbsp;т.&nbsp;п.), запретительные меры
        государственных органов (запрещение перевозок, валютные ограничения,
        международные санкции запрета на&nbsp;торговлю и&nbsp;т.&nbsp;п.).
        В&nbsp;течение этого времени СТОРОНЫ не&nbsp;имеют взаимных претензий,
        и&nbsp;каждая из&nbsp;СТОРОН принимает на&nbsp;себя свой риск
        последствия форс-мажорных обстоятельств.
      </p>
      <p>Статья&nbsp;10. Срок действия договора.</p>
      <p>
        10.1. Настоящий ДОГОВОР вступает в&nbsp;силу с&nbsp;момента обращения
        в&nbsp;Интернет-магазин flowers-ukraine.com и&nbsp;оформления ЗАКАЗА,
        и&nbsp;заканчивается при полном исполнении обязательств СТОРОНАМИ.
      </p>
      <p>Статья&nbsp;11. Реквизиты интернет магазина.</p>
      <p>Адрес в&nbsp;сети Интернет&nbsp;&mdash; flowers-ukraine.com</p>
    </article>
  );
};

export default Contract;
